channel395-Durbin-example/constant/polyMesh/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.6                                   |
|   \\  /    A nd           | Web:      http://www.OpenFOAM.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1;

L 6.28;
D 3.14;

vertices        
(
 (0    0    0)
 ($L   0    0)
 (0    1    0)
 ($L   1    0)
 (0    2    0)
 ($L   2    0)
 (0    0   $D)
 ($L   0   $D)
 (0    1   $D)
 ($L   1   $D)
 (0    2   $D)
 ($L   2   $D)
);

blocks          
(
 hex (0 1 3 2 6 7 9 8) (4 90 1) simpleGrading (1 8 1)
 hex (2 3 5 4 8 9 11 10) (4 90 1) simpleGrading (1 0.125 1)
);

edges           
(
);

patches         
(
    wall bottomWall
    (
     (0 1 7 6)
     )
    wall topWall
    (
     (4 10 11 5)
     )
    cyclic sides1
    (
     (0 2 3 1)
     (6 7 9 8)
     )
    cyclic sides2
    (
     (2 4 5 3)
     (8 9 11 10)
     )
    cyclic inout1
    (
     (1 3 9 7)
     (0 6 8 2)
     )
    cyclic inout2
    (
     (3 5 11 9)
     (2 8 10 4)
     )
);

mergePatchPairs 
(
);

// ************************************************************************* //
