channel395-Durbin-example/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.6.y                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

6
(
    bottomWall
    {
        type            wall;
        nFaces          4;
        startFace       1256;
    }
    topWall
    {
        type            wall;
        nFaces          4;
        startFace       1260;
    }
    sides1
    {
        type            cyclic;
        nFaces          720;
        startFace       1264;
        featureCos      0.9;
    }
    sides2
    {
        type            cyclic;
        nFaces          720;
        startFace       1984;
        featureCos      0.9;
    }
    inout1
    {
        type            cyclic;
        nFaces          180;
        startFace       2704;
        featureCos      0.9;
    }
    inout2
    {
        type            cyclic;
        nFaces          180;
        startFace       2884;
        featureCos      0.9;
    }
)

// ************************************************************************* //
