channel395-Durbin-example/constant/RASProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.6                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      RASProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

RASModel        Durbin; // set time step to  0.01
// RASModel        Hanjalic; // Intially set time step to 0.002, and 0.01 thereafter

DurbinCoeffs
{
    CL         0.28;
    SSG        false;
    ellipticOperatorCorrection false;
    // beta       0.17; // 0.083 for SSG.
}

turbulence      on;

printCoeffs     on;


// ************************************************************************* //
