channel395-Durbin-example/0/p
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.6                                   |
|   \\  /    A nd           | Web:      http://www.OpenFOAM.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    bottomWall
      {
        type            zeroGradient;
      }
    topWall
      {
        type            zeroGradient;
      }
    sides1
      {
        type            cyclic;//empty;
      }
    sides2
      {
        type            cyclic;//empty;
      }
    inout1
      {
        type            cyclic;
      }
    inout2
      {
        type            cyclic;
      }
}

// ************************************************************************* //
