channel395-Durbin-example/0/R
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.6                                   |
|   \\  /    A nd           | Web:      http://www.OpenFOAM.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volSymmTensorField;
    object      R;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform (5e-5 0 0 5e-5 0 5e-5);

boundaryField
{
    bottomWall
    {
        type            fixedValue;
        value           uniform ( 0 0 0 0 0 0 );
    }

    topWall
    {
        type            fixedValue;
        value           uniform ( 0 0 0 0 0 0 );
    }
    sides1
      {
        type            cyclic;//empty;
      }
    sides2
      {
        type            cyclic;//empty;
      }
    inout1
      {
        type            cyclic;
      }
    inout2
      {
        type            cyclic;
      }
}

// ************************************************************************* //
