channel395-Durbin-example/0/f
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.6                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volSymmTensorField;
    location    "0";
    object      f;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 -1 0 0 0 0];

internalField   uniform (0 0 0 0 0 0);

boundaryField
{
    bottomWall
      {
        type            fixedInternalValue;   
      }
    topWall
      {
        type            fixedInternalValue;
      }
    sides1
      {
        type            cyclic;
      }
    sides2
      {
        type            cyclic;
      }
    inout1
      {
        type            cyclic;
      }
    inout2
      {
        type            cyclic;
      }
}


// ************************************************************************* //
