channel395-Durbin-example/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.6                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    p
    {
        solver          PCG;
        preconditioner  DIC;
        tolerance       1e-06;
        relTol          0.1;
    }

    pFinal
    {
       solver          PCG;
       preconditioner  DIC;
       tolerance       1e-09;
       relTol          0;
    }

    alpha
    {
       solver          PCG;
       preconditioner  DIC;
       tolerance       1e-08;
       relTol          0;
    }

    f
    {
       solver          PCG;
       preconditioner  DIC;
       tolerance       1e-08;
       relTol          0;
    }


    U
    {
        solver          PBiCG;
        preconditioner  DILU;
        tolerance       1e-08;
        relTol          0;
    }

    //    k
    // {
    //   solver          PBiCG;
    //   preconditioner  DILU;
    //   tolerance       1e-07;
    //   relTol          0;
    // }

    R
      {
        solver          PBiCG;
        preconditioner  DILU;
        tolerance       1e-08;
        relTol          0;
      }

    epsilon
     {
       solver          PBiCG;
       preconditioner  DILU;
       tolerance       1e-08;
       relTol          0;
    }
    k
     {
       solver          PBiCG;
       preconditioner  DILU;
       tolerance       1e-08;
       relTol          0;
    }

}

PISO
{
    nCorrectors     2;
    nNonOrthogonalCorrectors 0;
    pRefCell        0;
    pRefValue       0;
}
//relaxationFactors
//{
// p 0.2;
// U 0.7;
// k 0.5;
// epsilon 0.1;
// R 0.5;
  //  nuTilda 0.3;
//}

// ************************************************************************* //
