channel395-Durbin-example/system/sampleDict

/*--------------------------------*- C++ -*----------------------------------* \
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.6                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      sampleDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

interpolationScheme cell;

setFormat       raw;

sets
(
    data
    {
        type    midPoint;
        axis    y;
        start   ( 3.14 0 1.57 );
        end     ( 3.14 2.1 1.57 );
        //nPoints 80;
    }
);

surfaces        ();

fields          ( U k R epsilon f);


// ************************************************************************* //
